meliksahaltuntas/NucleoWB55/Projects/NUCLEO_BLE_TEST/Projects/P-NUCLEO-WB55.Nucleo/Applications/BLE/BLE_p2pServer/STM32_WPAN/App/app_ble.c
#endif /* P2P_SERVER2 != 0 */

#if (P2P_SERVER3 != 0)
static const char a_LocalName[] = {AD_TYPE_COMPLETE_LOCAL_NAME, 'P', '2', 'P', 'S', 'R', 'V', '3'};
uint8_t a_ManufData[14] = {sizeof(a_ManufData)-1,
                           AD_TYPE_MANUFACTURER_SPECIFIC_DATA,
                           0x01,                               /*SKD version */
                           CFG_DEV_ID_P2P_SERVER3,      /* STM32WB - P2P Server 3*/
                           0x00,                               /* GROUP A Feature */
                           0x00,                               /* GROUP A Feature */
                           0x00,                               /* GROUP B Feature */
                           0x00,                               /* GROUP B Feature */
                           0x00,                               /* BLE MAC start -MSB */
                           0x00,
                           0x00,
                           0x00,
                           0x00,
                           0x00,                               /* BLE MAC stop */
                          };
#endif /* P2P_SERVER3 != 0 */

#if (P2P_SERVER4 != 0)
static const char a_LocalName[] = {AD_TYPE_COMPLETE_LOCAL_NAME, 'P', '2', 'P', 'S', 'R', 'V', '4'};
uint8_t a_ManufData[14] = {sizeof(a_ManufData)-1,
                           AD_TYPE_MANUFACTURER_SPECIFIC_DATA,
                           0x01,                               /*SKD version */
                           CFG_DEV_ID_P2P_SERVER4,      /* STM32WB - P2P Server 4*/
                           0x00,                               /* GROUP A Feature */
                           0x00,                               /* GROUP A Feature */
                           0x00,                               /* GROUP B Feature */
                           0x00,                               /* GROUP B Feature */
                           0x00,                               /* BLE MAC start -MSB */
                           0x00,
                           0x00,
                           0x00,
                           0x00,
                           0x00,                               /* BLE MAC stop */
                          };
#endif /* P2P_SERVER4 != 0 */

#if (P2P_SERVER5 != 0)
static const char a_LocalName[] = {AD_TYPE_COMPLETE_LOCAL_NAME, 'P', '2', 'P', 'S', 'R', 'V', '5'};
uint8_t a_ManufData[14] = {sizeof(a_ManufData)-1,
                           AD_TYPE_MANUFACTURER_SPECIFIC_DATA,
                           0x01,                               /*SKD version */
                           CFG_DEV_ID_P2P_SERVER5,      /* STM32WB - P2P Server 5*/
                           0x00,                               /* GROUP A Feature */
                           0x00,                               /* GROUP A Feature */
                           0x00,                               /* GROUP B Feature */
                           0x00,                               /* GROUP B Feature */
                           0x00,                               /* BLE MAC start -MSB */
                           0x00,
                           0x00,
                           0x00,
                           0x00,
                           0x00,                               /* BLE MAC stop */
                          };
#endif /* P2P_SERVER5 != 0 */

#if (P2P_SERVER6 != 0)
static const char a_LocalName[] = {AD_TYPE_COMPLETE_LOCAL_NAME, 'P', '2', 'P', 'S', 'R', 'V', '6'};
uint8_t a_ManufData[14] = {sizeof(a_ManufData)-1,
                           AD_TYPE_MANUFACTURER_SPECIFIC_DATA,
                           0x01,                               /*SKD version */
                           CFG_DEV_ID_P2P_SERVER6,      /* STM32WB - P2P Server 6*/
                           0x00,                               /* GROUP A Feature */
                           0x00,                               /* GROUP A Feature */
                           0x00,                               /* GROUP B Feature */
                           0x00,                               /* GROUP B Feature */
                           0x00,                               /* BLE MAC start -MSB */
                           0x00,
                           0x00,
                           0x00,
                           0x00,
                           0x00,                               /* BLE MAC stop */
                          };
#endif /* P2P_SERVER6 != 0 */

/* USER CODE BEGIN PV */
// Name change functionality
static const char base_name[] = "DairyTag";
static char current_device_name[32];

// Scan response data for long name
static uint8_t scan_response_data[31];
static uint8_t scan_response_length = 0;

// Reset functionality
static uint8_t Reset_timer_Id;

// Name change functionality


// RADIO ACTIVITY MONITORING
typedef struct {
    uint32_t total_measurement_time;
    uint32_t radio_active_time;
    uint32_t tx_time;
    uint32_t rx_time;
    uint32_t scan_time;
    uint32_t adv_time;
    uint32_t last_activity_start;
    uint32_t measurement_start_time;
    uint8_t is_radio_active;
} RadioProfile_t;

static RadioProfile_t radio_profile = {0};
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
static void BLE_UserEvtRx(void *p_Payload);
static void BLE_StatusNot(HCI_TL_CmdStatus_t Status);
static void Ble_Tl_Init(void);
static void Ble_Hci_Gap_Gatt_Init(void);
static const uint8_t* BleGetBdAddress(void);
static void Adv_Request(APP_BLE_ConnStatus_t NewStatus);
static void Adv_Cancel(void);
static void Adv_Cancel_Req(void);
static void Switch_OFF_GPIO(void);
#if (L2CAP_REQUEST_NEW_CONN_PARAM != 0)
static void BLE_SVC_L2CAP_Conn_Update(uint16_t ConnectionHandle);
static void Connection_Interval_Update_Req(void);
#endif /* L2CAP_REQUEST_NEW_CONN_PARAM != 0 */

/* USER CODE BEGIN PFP */
static void Update_Device_Name_With_Counter(void);
static void Process_System_Reset(void);
static void Reset_System_Timeout(void);

static void Update_Device_Name_With_Counter(void);
static void Process_System_Reset(void);
static void Reset_System_Timeout(void);

// RADIO MONITORING FONKSIYONLARI
static void Print_Radio_Statistics(void);
static void Reset_Radio_Statistics(void);
/* USER CODE END PFP */

