meliksahaltuntas/NucleoWB55/Projects/NUCLEO_BLE_TEST/Projects/P-NUCLEO-WB55.Nucleo/Applications/BLE/BLE_p2pServer/STM32_WPAN/App/app_ble.c
  /* USER CODE BEGIN SVCCTL_App_Notification */

  /* USER CODE END SVCCTL_App_Notification */

  p_event_pckt = (hci_event_pckt*) ((hci_uart_pckt *) p_Pckt)->data;

  switch (p_event_pckt->evt)
  {
  case HCI_DISCONNECTION_COMPLETE_EVT_CODE:
  {
      p_disconnection_complete_event = (hci_disconnection_complete_event_rp0 *) p_event_pckt->data;

      if (p_disconnection_complete_event->Connection_Handle == BleApplicationContext.BleApplicationContext_legacy.connectionHandle)
      {
          BleApplicationContext.BleApplicationContext_legacy.connectionHandle = 0;
          BleApplicationContext.Device_Connection_Status = APP_BLE_IDLE;

          APP_DBG_MSG("=== SERVER: CLIENT DISCONNECTED ===\n");
          APP_DBG_MSG("Data transfer completed successfully\n");
          APP_DBG_MSG("Preparing system reset in 3 seconds...\n");

          // LED: Mavi - Transfer tamamlandı
          BSP_LED_Off(LED_RED);
          BSP_LED_Off(LED_GREEN);
          BSP_LED_On(LED_BLUE);

          // P2P service notification
          HandleNotification.P2P_Evt_Opcode = PEER_DISCON_HANDLE_EVT;
          HandleNotification.ConnectionHandle = BleApplicationContext.BleApplicationContext_legacy.connectionHandle;
          P2PS_APP_Notification(&HandleNotification);

          /* USER CODE BEGIN EVT_DISCONN_COMPLETE */
          Print_Radio_Statistics();
          // 3 saniye sonra reset (veri transferi tamamlandığı için)
          HW_TS_Start(Reset_timer_Id, (3*1000*1000/CFG_TS_TICK_VAL));
          /* USER CODE END EVT_DISCONN_COMPLETE */
      }
      break;
  }

    case HCI_LE_META_EVT_CODE:
    {
      p_meta_evt = (evt_le_meta_event*) p_event_pckt->data;
      /* USER CODE BEGIN EVT_LE_META_EVENT */

      /* USER CODE END EVT_LE_META_EVENT */
      switch (p_meta_evt->subevent)
      {
        case HCI_LE_CONNECTION_UPDATE_COMPLETE_SUBEVT_CODE:
#if (CFG_DEBUG_APP_TRACE != 0)
          p_connection_update_complete_event = (hci_le_connection_update_complete_event_rp0 *) p_meta_evt->data;
          APP_DBG_MSG(">>== HCI_LE_CONNECTION_UPDATE_COMPLETE_SUBEVT_CODE\n");
          APP_DBG_MSG("     - Connection Interval:   %.2f ms\n     - Connection latency:    %d\n     - Supervision Timeout: %d ms\n\r",
                       p_connection_update_complete_event->Conn_Interval*1.25,
                       p_connection_update_complete_event->Conn_Latency,
                       p_connection_update_complete_event->Supervision_Timeout*10);
#endif /* CFG_DEBUG_APP_TRACE != 0 */

          /* USER CODE BEGIN EVT_LE_CONN_UPDATE_COMPLETE */

          /* USER CODE END EVT_LE_CONN_UPDATE_COMPLETE */
          break;

        case HCI_LE_PHY_UPDATE_COMPLETE_SUBEVT_CODE:
          p_evt_le_phy_update_complete = (hci_le_phy_update_complete_event_rp0*)p_meta_evt->data;
          APP_DBG_MSG("==>> HCI_LE_PHY_UPDATE_COMPLETE_SUBEVT_CODE - ");
          if (p_evt_le_phy_update_complete->Status == 0)
          {
            APP_DBG_MSG("status ok \n");
          }
          else
          {
            APP_DBG_MSG("status nok \n");
          }

          ret = hci_le_read_phy(BleApplicationContext.BleApplicationContext_legacy.connectionHandle, &Tx_phy, &Rx_phy);
          if (ret != BLE_STATUS_SUCCESS)
          {
            APP_DBG_MSG("==>> hci_le_read_phy : fail\n\r");
          }
          else
          {
            APP_DBG_MSG("==>> hci_le_read_phy - Success \n");

            if ((Tx_phy == TX_2M) && (Rx_phy == RX_2M))
            {
              APP_DBG_MSG("==>> PHY Param  TX= %d, RX= %d \n\r", Tx_phy, Rx_phy);
            }
            else
            {
              APP_DBG_MSG("==>> PHY Param  TX= %d, RX= %d \n\r", Tx_phy, Rx_phy);
            }
          }
          /* USER CODE BEGIN EVT_LE_PHY_UPDATE_COMPLETE */

          /* USER CODE END EVT_LE_PHY_UPDATE_COMPLETE */
          break;

        case HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE:
        {
            p_connection_complete_event = (hci_le_connection_complete_event_rp0 *) p_meta_evt->data;

            // Timer'ı durdur (client bulundu)
            HW_TS_Stop(BleApplicationContext.Advertising_mgr_timer_Id);
            HW_TS_Stop(Reset_timer_Id);

            APP_DBG_MSG("=== SERVER: CLIENT CONNECTED ===\n");
            APP_DBG_MSG("Server Name: %s\n", current_device_name);
            APP_DBG_MSG("Client Address: %02x:%02x:%02x:%02x:%02x:%02x\n",
                        p_connection_complete_event->Peer_Address[5],
                        p_connection_complete_event->Peer_Address[4],
                        p_connection_complete_event->Peer_Address[3],
                        p_connection_complete_event->Peer_Address[2],
                        p_connection_complete_event->Peer_Address[1],
                        p_connection_complete_event->Peer_Address[0]);

            // LED: Yeşil - Client bağlandı
            BSP_LED_Off(LED_RED);
            BSP_LED_On(LED_GREEN);
            BSP_LED_Off(LED_BLUE);

            // Bağlantı bilgilerini kaydet
            BleApplicationContext.BleApplicationContext_legacy.connectionHandle = p_connection_complete_event->Connection_Handle;

            if (BleApplicationContext.Device_Connection_Status == APP_BLE_LP_CONNECTING) {
                BleApplicationContext.Device_Connection_Status = APP_BLE_CONNECTED_CLIENT;
            } else {
                BleApplicationContext.Device_Connection_Status = APP_BLE_CONNECTED_SERVER;
            }

            // P2P service notification
            HandleNotification.P2P_Evt_Opcode = PEER_CONN_HANDLE_EVT;
            HandleNotification.ConnectionHandle = BleApplicationContext.BleApplicationContext_legacy.connectionHandle;
            P2PS_APP_Notification(&HandleNotification);

            /* USER CODE BEGIN HCI_EVT_LE_CONN_COMPLETE */
            // Veri gönderimi için notification aktif olmasını bekle
            APP_DBG_MSG("Client connected, waiting for P2P notification enable...\n");
            // Advertising sona erdi
            uint32_t current_time = HAL_GetTick();
            radio_profile.adv_time += (current_time - radio_profile.measurement_start_time);
            APP_DBG_MSG("Advertising phase ended\n");
            /* USER CODE END HCI_EVT_LE_CONN_COMPLETE */
            break;
        }

        default:
          /* USER CODE BEGIN SUBEVENT_DEFAULT */

          /* USER CODE END SUBEVENT_DEFAULT */
          break;
      }

      /* USER CODE BEGIN META_EVT */

      /* USER CODE END META_EVT */
      break; /* HCI_LE_META_EVT_CODE */
    }

    case HCI_VENDOR_SPECIFIC_DEBUG_EVT_CODE:
      p_blecore_evt = (evt_blecore_aci*) p_event_pckt->data;
      /* USER CODE BEGIN EVT_VENDOR */

      /* USER CODE END EVT_VENDOR */
      switch (p_blecore_evt->ecode)
      {
        /* USER CODE BEGIN ecode */
        aci_gap_pairing_complete_event_rp0 *pairing_complete;

        case ACI_GAP_LIMITED_DISCOVERABLE_VSEVT_CODE:
          APP_DBG_MSG(">>== ACI_GAP_LIMITED_DISCOVERABLE_VSEVT_CODE \n");
          break; /* ACI_GAP_LIMITED_DISCOVERABLE_VSEVT_CODE */

        case ACI_GAP_PASS_KEY_REQ_VSEVT_CODE:
          APP_DBG_MSG(">>== ACI_GAP_PASS_KEY_REQ_VSEVT_CODE \n");

          ret = aci_gap_pass_key_resp(BleApplicationContext.BleApplicationContext_legacy.connectionHandle,123456);
          if (ret != BLE_STATUS_SUCCESS)
          {
            APP_DBG_MSG("==>> aci_gap_pass_key_resp : Fail, reason: 0x%x\n", ret);
          }
          else
          {
            APP_DBG_MSG("==>> aci_gap_pass_key_resp : Success \n");
          }
          break; /* ACI_GAP_PASS_KEY_REQ_VSEVT_CODE */

        case ACI_GAP_AUTHORIZATION_REQ_VSEVT_CODE:
          APP_DBG_MSG(">>== ACI_GAP_AUTHORIZATION_REQ_VSEVT_CODE\n");
          break; /* ACI_GAP_AUTHORIZATION_REQ_VSEVT_CODE */

